app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" ORDER BY created_at desc LIMIT 3
---
  def index
    @songs = Song.limit(3).order("created_at desc")

INSERT INTO "songs" ("updated_at", "artist", "name", "created_at") VALUES ('2011-08-16 19:57:12.760473', 'asdfasdfsd', 'asdfafdsd', '2011-08-16 19:57:12.760473')
---
  def create
    @song = Song.new(params[:song])

    respond_to do |format|
      if @song.save